Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F14A.tmx
Source language: en_us
Languages: zh_cn

source: Getting Married and Staying Married
zh_cn: 结婚和经营婚姻

source: "Any advice for those of us who are new at marriage?" asked a former student, a young woman whose wedding we attended last year. She was responding to a Facebook post where I'd shameless hoisted up a picture of my husband and myself celebrating our 23rd anniversary.
zh_cn: “给我们这些刚步入婚姻殿堂的人提些建议吧？”这是我以前的一个女学生，我们去年刚参加了她的婚礼，她在脸书上看到我大方地晒出了我和老公23周年结婚纪念日的照片后这样问我。

source: Like many of the other young people we love-- people sculpted by the world, by their own intelligence, and by their own sensitivity into choosing excellent partners--it was an honor to be at their beautiful and festive wedding.
zh_cn: 就像我们热爱的许多年轻人那样——他们由这个世界塑造，凭借自己的智慧和感觉选择了他们优秀的另一半——能去参加他们美好的婚礼是我们的荣幸。

source: And I think she's wise to ask for advice.
zh_cn: 我想她向我征求建议也是非常聪明的。

source: The first years are tough.
zh_cn: 结婚后最初的几年往往不是那么顺利。

source: Time passes faster as you get older; we call it the "Time Doppler Effect" in our family since the time is already gone by the time you even notice it.
zh_cn: 年龄越大，时间过得越快，我们称它为“时间多普勒效应”，而当你意识到它的时候，时间已经匆匆流逝了。

source: So my husband and I have been married for 23 years and we're still laughing every day--often at each other and always at the world.
zh_cn: 因此，即使我们已经结婚23年，我和我的丈夫仍然可以每天开心快乐，不仅两人世界的时候这样，在外边也是如此。

source: But what is there to say on the occasion of a first wedding anniversary?
zh_cn: 但是，对于刚刚结婚一周年的夫妻，我们该说些什么呢？

source: Well, to start off with, the bridal catalogs and etiquette books get it TOTALLY wrong when it comes to designating what to give couples as gifts for their various anniversaries.
zh_cn: 那么，我要说，从一开始，从婚礼礼单开始标明新人们每年结婚纪念日的礼物开始，它就是完全错误的。

source: My little booklet from the card store (an absolutely authoritative text) offers the following schedule: the first year, you're supposed to give paper for a present; after ten years, tin; after fifty-years, gold; after seventy-five years, diamonds.
zh_cn: 我从一家经营卡片的店里买到的一个小册子这样写到（一个绝对权威的版本）：第一年结婚纪念日，礼物应该是纸片；十年，礼物是锡；五十年，礼物是金子；七十五年，礼物是钻石。

source: As you can already see, this sequence is badly designed.
zh_cn: 正如你所看到的，这个顺序设计的非常糟糕。

source: Frankly, if a couple can make it through the first year of marriage still more or less liking one another, they deserve more than stationary. Two people must have prodigious amounts of strength and courage to make it through the first year of marriage, not to mention tolerance, tenderness, and a tremendous sense of humor.
zh_cn: 坦率地说，如果一对新人能够顺利地过完婚后的第一年，而仍然喜欢彼此的话，这不仅仅是因为双方的稳重，也需要巨大的努力和勇气，宽容、温柔和幽默感就更不用说了。

source: Paper just doesn't cut it.
zh_cn: 一张纸可是远远达不到的。

source: All anniversaries should be celebrated with gusto--with brass bands and parades.
zh_cn: 所有的结婚纪念日都应该满怀热情地庆祝——以铜管乐队和游行的方式。

source: We should let couples know we give them credit for having made it through the field of landmines waiting for almost all unsuspecting lovers when they risk the marital journey.
zh_cn: 我们应该让新人们知道，我们相信，他们将勇闯婚姻旅程中的地雷，并最终真爱无敌。

source: Don't get me wrong--I'm not warning folks away from weddings.
zh_cn: 不要认为我是错误的——我并不是危言耸听。

source: I am delighted to be married to my husband and consider our marriage to be one of the best parts of my life.
zh_cn: 我很高兴嫁给了我的丈夫，并认为我们的婚姻是我生命中最美好的部分。

source: But the first twelve-month stretch of our lives together felt like one of the hardest, oh, hundred years of my life.
zh_cn: 但是，最初的十二个月却是最艰难的，嗯，应该是一百年中最艰难的。

source: I know my husband felt the same way.
zh_cn: 我确定我丈夫与我是同样的感受。

source: Good marriages are hard work.
zh_cn: 经营幸福的婚姻并不是一件轻松的事情。

source: What's tough about the first year?
zh_cn: 婚姻中的第一年为什么最难熬呢？

source: Realizing that THIS IS IT, OHMYGOD, I'M GOING TO BE WITH THIS PERSON FOR THE REST OF MY LIFE! Think about how many different ways that can be said or thought--you could use that one sentence alone as an audition piece for a Broadway show because, depending on your tone and expression, it can convey ecstasy or despair.
zh_cn: 认识到事实就是如此，哦，我的上帝，我余下的人生，将要一直与这个人在一起！想想看，这句话将以多少形式被提出或想到——你也可以将这句话以百老汇秀的方式体会一下，因为，不同的语气和表达方式，可以让你入迷，也可以让你绝望。

source: You can say it when thinking "Amazing.
zh_cn: 你可以这样说：“太好了。

source: I feel relaxed as soon as I walk in the door.
zh_cn: 从我踏进门的那一刻起，我就感觉放松。

source: I finally feel, now that I am with my partner, as if I am really and truly home.
zh_cn: 我真正的认识到，只要我跟自己的另一半在一起，那就是家。

source: Never before has any other person helped me believe in myself so fully or helped me become myself so entirely as this miraculous individual."
zh_cn: 以前从来没有人让我如此相信自己；也没有人让我体会到做自己是这样美妙的事情。”

source: Or you can say it when thinking, "I can't even breathe normally anymore for fear that I'll be observed and notes will be taken.
zh_cn: 或者你可以这样说：“一想到我将被时时关注，还得遵从一些规矩，我就喘不过气。

source: I can't believe the number of compromises and adjustments I've already made just in the small amount of time we've been together and that I will have to continue making until the end of time.
zh_cn: 简直不能相信，在简短的时间里我已经做出那么多的妥协和让步，并且，我接下来的一生都要这样做。

source: I can never be myself again."
zh_cn: 我再也成不了自己了。”

source: And I suspect that both interpretations get rehearsed often within the first year of marriage.
zh_cn: 我猜，在第一年的婚姻生活中，上面两种情形将被频繁上演。

source: Ceremonies change things; after all, that's why ceremonies exist.
zh_cn: 婚礼让婚姻变得美好。最终，这也是婚礼存在的原因所在。

source: A wedding transforms a relationship.
zh_cn: 一场婚礼使朋友关系得到升华。

source: Even couples that have lived together for years discover newness once they are officially married--sort of like getting a favorite pair of shoes resoled.
zh_cn: 即使是在一起生活多年的伴侣，一旦正式结婚，他们也能找到新鲜感——就像给一双最喜欢的鞋子换了新鞋底一样。

source: It's the same comfortable fit, but there is a fundamental difference--a difference sought out and designed but one that makes it feel, well, different (even if it feels better).
zh_cn: 两件事情同样感觉美好，但却有本质上的不同——婚礼是我们刻意计划并举行的，但是它确实让我们的生活发生了变化。

source: Don't be surprised.
zh_cn: 对它的神奇效果不用惊讶。

source: So here's a toast to those who are recently wed and to those who have simply (ha--as if it were simple!) remained married: May you always want to come home to each other and make a home within one another. May every year fill your lives with laughter, knowledge, awareness, and understanding; may every year become smoother and better than the one before; may every year be golden and glittering because of the richness of your life together.
zh_cn: 在这里，祝福那些刚结婚的和那些轻松地经营婚姻的人们（哈，好像经营婚姻是简单的一样）：愿你们时常愿意回家见到彼此，给彼此一个家；愿你们的生活中每年都充满笑声、智慧、参悟和理解；愿你们一年比一年过的顺利，过的好；愿你们每年都是金婚，生活像金子一样闪闪发光，因为两个人在一起的生活是那么的丰富多彩。

source: And to those of us who have been married 23 years or more? Here's to true love.
zh_cn: 最后，祝福那些像我们一样结婚二十三周年甚至更长时间的夫妻，愿真爱永恒！
